// Напишите программу, которай на вход принимает число и выдает ее квадрат(число умноженное само нас себя)
Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine(square);

